In [4]:
import numpy as np
import pandas as pd

In [5]:
df = pd.read_csv('./spam.csv', encoding='latin1')

In [6]:
df.head()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,ham,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,ham,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,spam,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,ham,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,ham,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN

In [7]:
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
5214,spam,Natalja (25/F) is inviting you to be her frien...,NaN,NaN,NaN
4785,ham,Holy living christ what is taking you so long,NaN,NaN,NaN
421,spam,Someone has contacted our dating service and e...,NaN,NaN,NaN
4160,spam,Had your mobile 11 months or more? U R entitle...,NaN,NaN,NaN
5484,ham,", , and picking them up from various points ...",NaN,NaN,NaN

In [8]:
dff = pd.read_csv('./spam.csv', encoding='ISO-8859-1')

In [9]:
dff.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
213,ham,Yup... How Ì_ noe leh...,NaN,NaN,NaN
4358,ham,ÌÏ only send me the contents page...,NaN,NaN,NaN
1855,ham,K.:)you are the only girl waiting in reception...,NaN,NaN,NaN
3190,spam,UR awarded a City Break and could WIN a å£200 ...,NaN,NaN,NaN
1934,ham,Hope you are having a great day.,NaN,NaN,NaN

In [10]:
df.tail()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
5567,spam,This is the 2nd time we have tried 2 contact u...,NaN,NaN,NaN
5568,ham,Will Ì_ b going to esplanade fr home?,NaN,NaN,NaN
5569,ham,"Pity, * was in mood for that. So...any other s...",NaN,NaN,NaN
5570,ham,The guy did some bitching but I acted like i'd...,NaN,NaN,NaN
5571,ham,Rofl. Its true to its name,NaN,NaN,NaN

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [12]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [13]:
# 1. Data Cleaning
# 2. EDA
# 3. Text Preprocessing
# 4. Model building
# 5. Evaluation 
# 6. Improvement 
# 7. Website 
# 8. Deploy

### 1. Data Cleaning

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [15]:
# drop last 3 columns as they have many null values

df.drop(columns=['Unnamed: 2', 'Unnamed: 3','Unnamed: 4'],inplace=True)

In [16]:
df.head()

     v1                                                 v2
0   ham  Go until jurong point, crazy.. Available only ...
1   ham                      Ok lar... Joking wif u oni...
2  spam  Free entry in 2 a wkly comp to win FA Cup fina...
3   ham  U dun say so early hor... U c already then say...
4   ham  Nah I don't think he goes to usf, he lives aro...

In [17]:
# renaming the columns

df.rename(columns={'v1':'target','v2':'text'}, inplace=True)

In [18]:
df.sample(5)

     target                                               text
640     ham  Well imma definitely need to restock before th...
4160   spam  Had your mobile 11 months or more? U R entitle...
2037    ham                           Oh sorry please its over
5449   spam  Latest News! Police station toilet stolen, cop...
2026    ham  Nah man, my car is meant to be crammed full of...

In [19]:
# 10:00
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [ ]:
# spam label as 1
# ham label as 0
df['target'] = encoder.fit_transform(df['target'])

In [21]:
df.head()

   target                                               text
0       0  Go until jurong point, crazy.. Available only ...
1       0                      Ok lar... Joking wif u oni...
2       1  Free entry in 2 a wkly comp to win FA Cup fina...
3       0  U dun say so early hor... U c already then say...
4       0  Nah I don't think he goes to usf, he lives aro...

In [22]:
# missing values
df.isnull().sum()

target    0
text      0
dtype: int64

In [ ]:
df.duplicated().sum()

In [28]:
df[df.duplicated()].head(10)

     target                                               text
102       0  As per your request 'Melle Melle (Oru Minnamin...
153       0  As per your request 'Melle Melle (Oru Minnamin...
206       0  As I entered my cabin my PA said, '' Happy B'd...
222       0                             Sorry, I'll call later
325       0                   No calls..messages..missed calls
338       0                             Sorry, I'll call later
356       1  Congratulations ur awarded 500 of CD vouchers ...
443       0                             Sorry, I'll call later
532       0                  Gudnite....tc...practice going on
654       0                       Did u got that persons story

In [29]:
df = df.drop_duplicates(keep='first')

In [30]:
df.duplicated().sum()

np.int64(0)

In [32]:
df.shape

(5169, 2)